In [1]:
#importing required libraries --1
import pandas as pd
import numpy as np

In [2]:
#Importing the dataset  --2
df=pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user')

In [3]:
df.sample(10)

    user_id|age|gender|occupation|zip_code
541                 542|21|M|student|60515
794              795|30|M|programmer|08610
385                386|36|M|salesman|43221
883                884|44|M|engineer|55337
395                396|57|M|engineer|94551
838           839|38|F|entertainment|90814
480                 481|73|M|retired|37771
143              144|53|M|programmer|20910
616                  617|27|F|writer|11201
462              463|48|F|healthcare|75218

In [4]:
df.isnull().sum()

user_id|age|gender|occupation|zip_code    0
dtype: int64

In [5]:
# Assign it to a variable called users --3
df[['user_id','age','gender','occupation','zip_code']]=df['user_id|age|gender|occupation|zip_code'].str.split('|',expand= True)
users = df.drop('user_id|age|gender|occupation|zip_code',axis =1)

In [6]:
# use the 'user_id' as index --3
users.set_index('user_id',drop=False)

        user_id age gender     occupation zip_code
user_id
1             1  24      M     technician    85711
2             2  53      F          other    94043
3             3  23      M         writer    32067
4             4  24      M     technician    43537
5             5  33      F          other    15213
...         ...  ..    ...            ...      ...
939         939  26      F        student    33319
940         940  32      M  administrator    02215
941         941  20      M        student    97229
942         942  48      F      librarian    78209
943         943  22      M        student    77841

[943 rows x 5 columns]

In [7]:
#See the first 25 entries --4
users.head(25)

   user_id age gender     occupation zip_code
0        1  24      M     technician    85711
1        2  53      F          other    94043
2        3  23      M         writer    32067
3        4  24      M     technician    43537
4        5  33      F          other    15213
5        6  42      M      executive    98101
6        7  57      M  administrator    91344
7        8  36      M  administrator    05201
8        9  29      M        student    01002
9       10  53      M         lawyer    90703
10      11  39      F          other    30329
11      12  28      F          other    06405
12      13  47      M       educator    29206
13      14  45      M      scientist    55106
14      15  49      F       educator    97301
15      16  21      M  entertainment    10309
16      17  30      M     programmer    06355
17      18  35      F          other    37212
18      19  40      M      librarian    02138
19      20  42      F      homemaker    95660
20      21  26      M         writer    30068
21      22  25      M         writer    40206
22      23  30      F         artist    48197
23      24  21      F         artist    94533
24      25  39      M       engineer    55107

In [8]:
#See the last 10 entries --5
users.tail(10)

    user_id age gender     occupation zip_code
933     934  61      M       engineer    22902
934     935  42      M         doctor    66221
935     936  24      M          other    32789
936     937  48      M       educator    98072
937     938  38      F     technician    55038
938     939  26      F        student    33319
939     940  32      M  administrator    02215
940     941  20      M        student    97229
941     942  48      F      librarian    78209
942     943  22      M        student    77841

In [9]:
#What is the number of observations in the dataset? --6
observations = len(users.axes[0])
observations

943

In [10]:
#What is the number of columns in the dataset? --7
columns = len(users.axes[1])
columns

5

In [11]:
#Print the name of all the columns. --8
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [12]:
#How is the dataset indexed? --9
print(users.index)

RangeIndex(start=0, stop=943, step=1)

In [13]:
#What is the data type of each column? --10
users.dtypes

user_id       object
age           object
gender        object
occupation    object
zip_code      object
dtype: object

In [14]:
#Print only the occupation column --11
occup_occur = users.groupby('occupation').size()
occup_occur

occupation
administrator     79
artist            28
doctor             7
educator          95
engineer          67
entertainment     18
executive         32
healthcare        16
homemaker          7
lawyer            12
librarian         51
marketing         26
none               9
other            105
programmer        66
retired           14
salesman          12
scientist         31
student          196
technician        27
writer            45
dtype: int64

In [15]:
#How many different occupations are in this dataset? --12
count = len(users.occupation.unique())
count

21

In [16]:
#What is the most frequent occupation? --13
users['occupation'].value_counts().idxmax()

'student'

In [17]:
#Summarize the DataFrame. --14
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    object
 1   age         943 non-null    object
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: object(5)
memory usage: 37.0+ KB

In [18]:
#Summarize all the columns --15
users.describe()

       user_id  age gender occupation zip_code
count      943  943    943        943      943
unique     943   61      2         21      795
top          1   30      M    student    55414
freq         1   39    670        196        9

In [19]:
# Summarize only the occupation column --16
users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [20]:
#What is the mean age of users? --17
users['age']=pd.to_numeric(users['age'])
users[['age']].mean()

age    34.051962
dtype: float64

In [21]:
#What is the age with least occurrence? --18
users['age'].value_counts().idxmin()

7